spring2019/psyc5301/psyc5301-spring2019.org
#+TITLE: PSYC 5301: Research Methods
#+AUTHOR: 
#+DATE: Spring 2019
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [10pt]
#+LATEX_HEADER: \usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}

** Contact info
- Professor: Thomas J. Faulkenberry, Ph.D
- Office: Math 319
- Office hours: MWF 1-3 pm, TR 9-11 am
- Email: faulkenberry@tarleton.edu
- Website: [[http://tomfaulkenberry.github.io]]
- Phone: 254-968-9816

** Course description

This course is essentially a continuation of the study of statistics that you have already begun in your graduate studies. It is designed to provide you with a solid grounding in the theory and practice of experimental design and subsequent statistical modeling that form the empirical basis of modern psychological science. In addition, we will discuss some of the /philosophical/ underpinning of modern scientific inference and wade into the debate on frequentist versus Bayesian approaches to inference.  We will accomplish this through weekly lectures, textbook reading, homework exercises, and periodic exams. All students enrolled in this course are required to have *previously taken* PSYC 5300 (Behavioral Statistics) or have equivalent statistical background.

** Course materials

- Textbook
  - /Experiment design for the social and behavioural sciences/ by Boniface
- Software
  - R (free download from r-project.org)
  - RStudio (free download from rstudio.org)
  - JASP (free download from [[http://jasp-stats.org][jasp-stats.org]]).  
- Calculator
  - though, strictly speaking, you can use R for all of your calculation needs, you should have a standalone calculator that is capable of performing the most basic scientific computations (exponents, square roots, logarithms, etc.). A graphing calculator is /not/ required, though I will be using one (TI-84) when I demonstrate calculations. Find one you like using!

** Student learning outcomes

1. Understand the classical elements of inference in psychological research, including basic probability theory, hypothesis testing, and error control
2. Know the basic elements of experimental design (e.g., measurement, random assignment, etc.)
3. Understand the mechanics of classical analysis of variance in single-factor and two-factor design
4. Know how to adapt inferential procedures for within-subjects designs and, more generally, designs with covariates
5. Understand the differences between frequentist and Bayesian approaches to hypothesis testing
6. Use appropriate software packages to perform both frequentist and Bayesian hypothesis tests for a variety of experimental designs

** Requirements and grading
- Exam 1 (100 points)
- Exam 2 (100 points)
- Exam 3 (100 points)
- Homework exercises (100 points)
- Class participation (100 points)
- /Total = 500 points/

Grades will be assigned based on the percentage of points you accumulate out of these 500 points.  I will use the standard grading scale of A=90%, B=80%, etc.

*** Exams (60% of grade)
There will be three regular exams throughout the semester, tentatively scheduled for Week 5 (Feb 11), Week 11 (Apr 2), and Week 16 (May 7). Exams will be completed in class on these dates, and you will have the entire class period (6:30-9:15 pm) to complete the exam. All work will be submitted in a bluebook, and no collaboration will be allowed. Generally speaking, no textbooks or lecture notes may be used on exams, but reasonable relaxations of this rule will be provided on a per-exam basis (depending on difficulty of content, etc.).

*** Homework exercises (20% of grade)
Each week at the end of lecture, you will be given a set of exercises that will provide you with an opportunity to practice the concepts you've learned. You may collaborate on these exercises, but I ask that anything turned in represents your own understanding of the collaborative work. Please write neatly, and clearly label each problem. Homework will be turned in at the beginning of the next class (i.e., you'll have exactly one week to complete the problems).

