spring2019/psyc5301/psyc5301-spring2019.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-30 Wed 14:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PSYC 5301: Research Methods</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">PSYC 5301: Research Methods</h1>

<div id="outline-container-org86eb8a9" class="outline-2">
<h2 id="org86eb8a9">Contact info</h2>
<div class="outline-text-2" id="text-org86eb8a9">
<ul class="org-ul">
<li>Professor: Thomas J. Faulkenberry, Ph.D</li>
<li>Office: Math 319</li>
<li>Office hours: MWF 1-3 pm, TR 9-11 am</li>
<li>Email: faulkenberry@tarleton.edu</li>
<li>Website: <a href="http://tomfaulkenberry.github.io">http://tomfaulkenberry.github.io</a></li>
<li>Phone: 254-968-9816</li>
</ul>
</div>
</div>

<div id="outline-container-orga8dedd4" class="outline-2">
<h2 id="orga8dedd4">Course description</h2>
<div class="outline-text-2" id="text-orga8dedd4">
<p>
This course is essentially a continuation of the study of statistics that you have already begun in your graduate studies. It is designed to provide you with a solid grounding in the theory and practice of experimental design and subsequent statistical modeling that form the empirical basis of modern psychological science. In addition, we will discuss some of the <i>philosophical</i> underpinning of modern scientific inference and wade into the debate on frequentist versus Bayesian approaches to inference.  We will accomplish this through weekly lectures, textbook reading, homework exercises, and periodic exams. All students enrolled in this course are required to have <b>previously taken</b> PSYC 5300 (Behavioral Statistics) or have equivalent statistical background.
</p>
</div>
</div>

<div id="outline-container-org68773e9" class="outline-2">
<h2 id="org68773e9">Course materials</h2>
<div class="outline-text-2" id="text-org68773e9">
<ul class="org-ul">
<li>Textbook
<ul class="org-ul">
<li><i>Experiment design for the social and behavioural sciences</i> by Boniface</li>
</ul></li>
<li>Software
<ul class="org-ul">
<li>R (free download from r-project.org)</li>
<li>RStudio (free download from rstudio.org)</li>
<li>JASP (free download from <a href="http://jasp-stats.org">jasp-stats.org</a>).</li>
</ul></li>
<li>Calculator
<ul class="org-ul">
<li>though, strictly speaking, you can use R for all of your calculation needs, you should have a standalone calculator that is capable of performing the most basic scientific computations (exponents, square roots, logarithms, etc.). A graphing calculator is <i>not</i> required, though I will be using one (TI-84) when I demonstrate calculations. Find one you like using!</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org23cf2de" class="outline-2">
<h2 id="org23cf2de">Student learning outcomes</h2>
<div class="outline-text-2" id="text-org23cf2de">
<ol class="org-ol">
<li>Understand the classical elements of inference in psychological research, including basic probability theory, hypothesis testing, and error control</li>
<li>Know the basic elements of experimental design (e.g., measurement, random assignment, etc.)</li>
<li>Understand the mechanics of classical analysis of variance in single-factor and two-factor design</li>
<li>Know how to adapt inferential procedures for within-subjects designs and, more generally, designs with covariates</li>
<li>Understand the differences between frequentist and Bayesian approaches to hypothesis testing</li>
<li>Use appropriate software packages to perform both frequentist and Bayesian hypothesis tests for a variety of experimental designs</li>
</ol>
</div>
</div>

<div id="outline-container-orga27473b" class="outline-2">
<h2 id="orga27473b">Requirements and grading</h2>
<div class="outline-text-2" id="text-orga27473b">
<ul class="org-ul">
<li>Exam 1 (100 points)</li>
<li>Exam 2 (100 points)</li>
<li>Exam 3 (100 points)</li>
<li>Homework exercises (100 points)</li>
<li>Class participation (100 points)</li>
<li><i>Total = 500 points</i></li>
</ul>

<p>
Grades will be assigned based on the percentage of points you accumulate out of these 500 points.  I will use the standard grading scale of A=90%, B=80%, etc.
</p>
</div>

<div id="outline-container-org39a9176" class="outline-3">
<h3 id="org39a9176">Exams (60% of grade)</h3>
<div class="outline-text-3" id="text-org39a9176">
<p>
There will be three regular exams throughout the semester, tentatively scheduled for Week 5 (Feb 11), Week 11 (Apr 2), and Week 16 (May 7). Exams will be completed in class on these dates, and you will have the entire class period (6:30-9:15 pm) to complete the exam. All work will be submitted in a bluebook, and no collaboration will be allowed. Generally speaking, no textbooks or lecture notes may be used on exams, but reasonable relaxations of this rule will be provided on a per-exam basis (depending on difficulty of content, etc.).
</p>
</div>
</div>

<div id="outline-container-org5912e63" class="outline-3">
<h3 id="org5912e63">Homework exercises (20% of grade)</h3>
<div class="outline-text-3" id="text-org5912e63">
<p>
Each week at the end of lecture, you will be given a set of exercises that will provide you with an opportunity to practice the concepts you've learned. You may collaborate on these exercises, but I ask that anything turned in represents your own understanding of the collaborative work. Please write neatly, and clearly label each problem. Homework will be turned in at the beginning of the next class (i.e., you'll have exactly one week to complete the problems).
</p>
</div>
</div>
