spring2019/psyc5301/psyc5301-spring2019.tex
% Created 2019-01-02 Wed 13:15
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}
\date{Spring 2019}
\title{PSYC 5301: Research Methods}
\hypersetup{
 pdfauthor={},
 pdftitle={PSYC 5301: Research Methods},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Contact info}
\label{sec:orgbaf2964}
\begin{itemize}
\item Professor: Thomas J. Faulkenberry, Ph.D
\item Office: Math 319
\item Office hours: MWF 1-3 pm, TR 9-11 am
\item Email: faulkenberry@tarleton.edu
\item Website: \url{http://tomfaulkenberry.github.io}
\item Phone: 254-968-9816
\end{itemize}

\section*{Course description}
\label{sec:org6b58e5d}

This course is essentially a continuation of the study of statistics that you have already begun in your graduate studies. It is designed to provide you with a solid grounding in the theory and practice of experimental design and subsequent statistical modeling that form the empirical basis of modern psychological science. In addition, we will discuss some of the \emph{philosophical} underpinning of modern scientific inference and wade into the debate on frequentist versus Bayesian approaches to inference.  We will accomplish this through weekly lectures, textbook reading, homework exercises, and periodic exams. All students enrolled in this course are required to have \textbf{previously taken} PSYC 5300 (Behavioral Statistics) or have equivalent statistical background.

\section*{Course materials}
\label{sec:org6142f74}

\begin{itemize}
\item Textbook
\begin{itemize}
\item \emph{Experiment design for the social and behavioural sciences} by Boniface
\end{itemize}
\item Software
\begin{itemize}
\item R (free download from r-project.org)
\item RStudio (free download from rstudio.org)
\item JASP (free download from \href{http://jasp-stats.org}{jasp-stats.org}).
\end{itemize}
\item Calculator
\begin{itemize}
\item though, strictly speaking, you can use R for all of your calculation needs, you should have a standalone calculator that is capable of performing the most basic scientific computations (exponents, square roots, logarithms, etc.). A graphing calculator is \emph{not} required, though I will be using one (TI-84) when I demonstrate calculations. Find one you like using!
\end{itemize}
\end{itemize}

\section*{Student learning outcomes}
\label{sec:org6b5068a}

\begin{enumerate}
\item Understand the classical elements of inference in psychological research, including basic probability theory, hypothesis testing, and error control
\item Know the basic elements of experimental design (e.g., measurement, random assignment, etc.)
\item Understand the mechanics of classical analysis of variance in single-factor and two-factor design
\item Know how to adapt inferential procedures for within-subjects designs and, more generally, designs with covariates
\item Understand the differences between frequentist and Bayesian approaches to hypothesis testing
\item Use appropriate software packages to perform both frequentist and Bayesian hypothesis tests for a variety of experimental designs
\end{enumerate}

\section*{Requirements and grading}
\label{sec:org0577df2}
\begin{itemize}
\item Exam 1 (100 points)
\item Exam 2 (100 points)
\item Exam 3 (100 points)
\item Homework exercises (100 points)
\item Class participation (100 points)
\item \emph{Total = 500 points}
\end{itemize}

Grades will be assigned based on the percentage of points you accumulate out of these 500 points.  I will use the standard grading scale of A=90\%, B=80\%, etc.

\subsection*{Exams (60\% of grade)}
\label{sec:orge63b263}
There will be three regular exams throughout the semester, tentatively scheduled for Week 5 (Feb 11), Week 11 (Apr 2), and Week 16 (May 7). Exams will be completed in class on these dates, and you will have the entire class period (6:30-9:15 pm) to complete the exam. All work will be submitted in a bluebook, and no collaboration will be allowed. Generally speaking, no textbooks or lecture notes may be used on exams, but reasonable relaxations of this rule will be provided on a per-exam basis (depending on difficulty of content, etc.).

\subsection*{Homework exercises (20\% of grade)}
\label{sec:org319e5d7}
Each week at the end of lecture, you will be given a set of exercises that will provide you with an opportunity to practice the concepts you've learned. You may collaborate on these exercises, but I ask that anything turned in represents your own understanding of the collaborative work. Please write neatly, and clearly label each problem. Homework will be turned in at the beginning of the next class (i.e., you'll have exactly one week to complete the problems).
