spring2019/psyc5301/psyc5301-spring2019.html

<div id="outline-container-org22898ed" class="outline-3">
<h3 id="org22898ed">Class participation (20% of grade)</h3>
<div class="outline-text-3" id="text-org22898ed">
<p>
This is a very active course, and we will learn a lot every week. It is essential that you participate in <i>all</i> class sessions. Your class participation grade will be reflective of the effort that I've seen you put into the course. Most people will earn all 100 possible points, but I reserve the right to lower this grade if you miss excessive class meetings. 
</p>
</div>
</div>
</div>

<div id="outline-container-org4748ff3" class="outline-2">
<h2 id="org4748ff3">Course Communication</h2>
<div class="outline-text-2" id="text-org4748ff3">
<p>
Email is the primary means of official communication for this course.  If you have questions about the course, always feel free to send me an email at faulkenberry@tarleton.edu.  I only ask that you adhere to two guidelines:
</p>
<ul class="org-ul">
<li>please include the course number (PSYC 5301) in the subject line.  For example, one good way to do this is:  Subject: [PSYC 5301] Question about HW 3</li>
<li>please use proper email etiquette.  Include a salutation (e.g., Dear Dr. Faulkenberry), complete sentences, and a closing (e.g., "Regards, Your Name").  You might be surprised how many times I get an email from a nondescript email address with no indication from WHOM the email was sent!</li>
</ul>

<p>
Also, I will send periodic class announcements via email.  Thus, it is imperative that you check your <i>Tarleton email address</i> regularly so that you don't miss any of these messages.
</p>
</div>
</div>

<div id="outline-container-org9544541" class="outline-2">
<h2 id="org9544541">University Policy on "F" Grades</h2>
<div class="outline-text-2" id="text-org9544541">
<p>
Beginning in Fall 2015, Tarleton began differentiating between a failed grade in a class because a student never attended (F0 grade), stopped attending at some point in the semester (FX grade), or because the student did not pass the course (F) but attended the entire semester. These grades will be noted on the official transcript. Stopping or never attending class can result in the student having to return aid monies received.  For more information see the Tarleton Financial Aid website.
</p>
</div>
</div>

<div id="outline-container-org608d026" class="outline-2">
<h2 id="org608d026">Academic Honesty</h2>
<div class="outline-text-2" id="text-org608d026">
<p>
Cheating, plagiarism (submitting another person’s materials or ideas as one’s own without proper attribution), or doing work for another person who will receive academic credit are all disallowed. This includes the use of unauthorized books, notebooks, or other sources in order to secure of give help during an examination, the unauthorized copying of examinations, assignments, reports, or term papers, or the presentation of unacknowledged material as if it were the student’s own work. Disciplinary action may be taken beyond the academic discipline administered by the faculty member who teaches the course in which the cheating took place.
</p>

<p>
The minimum sanction for <i>any</i> act of academic dishonesty is a grade of 0 on the affected assignment; a grade of F for the course may be assigned in severe cases.
</p>
</div>
</div>

<div id="outline-container-orgfde8f78" class="outline-2">
<h2 id="orgfde8f78">Academic Affairs Core Value Statements</h2>
<div class="outline-text-2" id="text-orgfde8f78">
</div>
<div id="outline-container-orgc38fc5f" class="outline-3">
<h3 id="orgc38fc5f">Academic Integrity Statement</h3>
<div class="outline-text-3" id="text-orgc38fc5f">
<p>
Tarleton State University's core values are integrity, leadership, tradition, civility, excellence, and service.  Central to these values is integrity, which is maintaining a high standard of personal and scholarly conduct.  Academic integrity represents the choice to uphold ethical responsibility for one’s learning within the academic community, regardless of audience or situation.
</p>
</div>
</div>

<div id="outline-container-org8487823" class="outline-3">
<h3 id="org8487823">Academic Civility Statement</h3>
<div class="outline-text-3" id="text-org8487823">
<p>
Students are expected to interact with professors and peers in a respectful manner that enhances the learning environment. Professors may require a student who deviates from this expectation to leave the face-to-face (or virtual) classroom learning environment for that particular class session (and potentially subsequent class sessions) for a specific amount of time. In addition, the professor might consider the university disciplinary process (for Academic Affairs/Student Life) for egregious or continued disruptive behavior.
</p>
</div>
</div>

<div id="outline-container-orgf749b7d" class="outline-3">
<h3 id="orgf749b7d">Academic Excellence Statement</h3>
<div class="outline-text-3" id="text-orgf749b7d">
<p>
Tarleton holds high expectations for students to assume responsibility for their own individual learning. Students are also expected to achieve academic excellence by:
</p>
<ul class="org-ul">
<li>honoring Tarleton’s core values, upholding high standards of habit and behavior.</li>
<li>maintaining excellence through class attendance and punctuality, preparing for active participation in all learning experiences.</li>
<li>putting forth their best individual effort.</li>
<li>continually improving as independent learners.</li>
<li>engaging in extracurricular opportunities that encourage personal and academic growth.</li>
<li>reflecting critically upon feedback and applying these lessons to meet future challenges.</li>
</ul>
</div>
</div>
</div>
