spring2019/psyc5301/psyc5301-spring2019.org
** Students with Disabilities Policy

It is the policy of Tarleton State University to comply with the Americans with Disabilities Act and other applicable laws. If you are a student with a disability seeking accommodations for this course, please contact the Center for Access and Academic Testing, at 254.968.9400 or caat@tarleton.edu. The office is located in Math 201. More information can be found at www.tarleton.edu/caat or in the University Catalog.

**Note:  any changes to this syllabus will be communicated to you by the instructor!**
 
** Schedule of lectures

 | Week | Date   | Topic                                                | Reading                  |
 |------+--------+------------------------------------------------------+--------------------------|
 |    1 | Jan 15 | Review of basic statistical inference                | Boniface, Ch 1-3         |
 |    2 | Jan 22 | Single-factor independent group design               | Boniface, Ch 4           |
 |    3 | Jan 29 | Single-factor repeated measures design               | Boniface, Ch 5           |
 |    4 | Feb 4  | Two-factor independent groups design                 | Boniface, Ch 6           |
 |    5 | Feb 11 | *Exam 1*                                             |                          |
 |    6 | Feb 18 | Single-factor independent groups design w/ covariate | Boniface, Ch 7           |
 |    7 | Feb 25 | Contrasts and comparisons among means                | Boniface, Ch 8           |
 |    8 | Mar 5  | Unbalanced and confounded designs                    | Boniface, Ch 10          |
 |    9 | Mar 19 | Multiple regression                                  | Boniface, Ch 11          |
 |   10 | Mar 26 | Mixed designs                                        | Boniface, Ch 12          |
 |   11 | Apr 2  | *Exam 2*                                             |                          |
 |   12 | Apr 9  | Introduction to Bayesian inference                   | Wagenmakers (2007, 2010) |
 |   13 | Apr 16 | Bayesian \(t\)-tests                                 | Rouder et al. (2007)     |
 |   14 | Apr 23 | Bayesian analysis of single- and two-factor designs  | Rouder et al. (2016)     |
 |   15 | Apr 30 | Bayesian analysis with inequality contraints         | Klugkist et al. (2005)   |
 |   16 | May 7  | *Exam 3*                                             |                          |
