spring2019/psyc5301/psyc5301-spring2019.html

<div id="outline-container-org35a7802" class="outline-2">
<h2 id="org35a7802">Students with Disabilities Policy</h2>
<div class="outline-text-2" id="text-org35a7802">
<p>
It is the policy of Tarleton State University to comply with the Americans with Disabilities Act and other applicable laws. If you are a student with a disability seeking accommodations for this course, please contact the Center for Access and Academic Testing, at 254.968.9400 or caat@tarleton.edu. The office is located in Math 201. More information can be found at www.tarleton.edu/caat or in the University Catalog.
</p>

<p>
<b><b>Note:  any changes to this syllabus will be communicated to you by the instructor!</b></b>
</p>
</div>
</div>

<div id="outline-container-org6b3e289" class="outline-2">
<h2 id="org6b3e289">Schedule of lectures</h2>
<div class="outline-text-2" id="text-org6b3e289">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Week</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Reading</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Jan 15</td>
<td class="org-left">Review of basic statistical inference</td>
<td class="org-left">Boniface, Ch 1-3</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Jan 22</td>
<td class="org-left">Single-factor independent group design</td>
<td class="org-left">Boniface, Ch 4</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Jan 29</td>
<td class="org-left">Single-factor repeated measures design</td>
<td class="org-left">Boniface, Ch 5</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Feb 4</td>
<td class="org-left">Two-factor independent groups design</td>
<td class="org-left">Boniface, Ch 6</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Feb 11</td>
<td class="org-left"><b>Exam 1</b></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Feb 18</td>
<td class="org-left">Single-factor independent groups design w/ covariate</td>
<td class="org-left">Boniface, Ch 7</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Feb 25</td>
<td class="org-left">Contrasts and comparisons among means</td>
<td class="org-left">Boniface, Ch 8</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">Mar 5</td>
<td class="org-left">Unbalanced and confounded designs</td>
<td class="org-left">Boniface, Ch 10</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">Mar 19</td>
<td class="org-left">Multiple regression</td>
<td class="org-left">Boniface, Ch 11</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Mar 26</td>
<td class="org-left">Mixed designs</td>
<td class="org-left">Boniface, Ch 12</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">Apr 2</td>
<td class="org-left"><b>Exam 2</b></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">Apr 9</td>
<td class="org-left">Introduction to Bayesian inference</td>
<td class="org-left">Wagenmakers (2007, 2010)</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">Apr 16</td>
<td class="org-left">Bayesian \(t\)-tests</td>
<td class="org-left">Rouder et al. (2007)</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">Apr 23</td>
<td class="org-left">Bayesian analysis of single- and two-factor designs</td>
<td class="org-left">Rouder et al. (2016)</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">Apr 30</td>
<td class="org-left">Bayesian analysis with inequality contraints</td>
<td class="org-left">Klugkist et al. (2005)</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">May 7</td>
<td class="org-left"><b>Exam 3</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Spring 2019</p>
<p class="date">Created: 2019-01-30 Wed 14:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
